OpenFOAM-v2506/tutorials/compressible/acousticFoam/obliqueAirJet/precursor/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication extrudeMesh

runApplication changeDictionary -constant

runApplication topoSet

runApplication createPatch -overwrite

# -----------------------------------------------------------------------------
